app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    if params[:artist_id].nil?
    @songs = Song.all
    else
      if (artist = Artist.find_by(id: params[:artist_id]))

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:artist_id]
      ((flash[:alert] = "Song not found") && redirect_to(artist_songs_path params[:artist_id])) if not (@song = Song.includes(:artist).where(id: params[:id]).where(artist_id: params[:artist_id]).first)
    else
      @song = Song.find(params[:id])